import random

xing = [
    '赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩', '杨', '朱', '秦', '尤', '许',
    '何', '吕', '施', '张', '孔', '曹', '严', '华', '金', '魏', '陶', '姜', '戚', '谢', '邹', '喻', '柏', '水', '窦', '章',
    '云', '苏', '潘', '葛', '奚', '范', '彭', '郎', '鲁', '韦', '昌', '马', '苗', '凤', '花', '方', '俞', '任', '袁', '柳',
    '酆', '鲍', '史', '唐', '费', '廉', '岑', '薛', '雷', '贺', '倪', '汤', '滕', '殷', '罗', '毕', '郝', '邬', '安', '常',
    '乐', '于', '时', '傅', '皮', '卞', '齐', '康', '伍', '余', '元', '卜', '顾', '孟', '平', '黄', '和', '穆', '萧', '尹',
    '姚', '邵', '堪', '汪', '祁', '毛', '禹', '狄', '米', '贝', '明', '臧', '计', '伏', '成', '戴', '谈', '宋', '茅', '庞',
    '熊', '纪', '舒', '屈', '项', '祝', '董', '梁', '第二', '第五','完颜','长孙','轩辕','上官','欧阳','司马','诸葛']

ming = [
    '的', '一', '是', '了', '我', '不', '人', '在', '他', '有', '这', '个', '上', '们', '来', '到', '时', '大', '地', '为',
    '子', '中', '你', '说', '生', '国', '年', '着', '就', '那', '和', '要', '她', '出', '也', '得', '里', '后', '自', '以',
    '会', '家', '可', '下', '而', '过', '天', '去', '能', '对', '小', '多', '然', '于', '心', '学', '么', '之', '都', '好',
    '看', '起', '发', '当', '没', '成', '只', '如', '事', '把', '还', '用', '第', '样', '道', '想', '作', '种', '开', '美',
    '总', '从', '无', '情', '己', '面', '最', '女', '但', '现', '前', '些', '所', '同', '日', '手', '又', '行', '意', '动',
    '方', '期', '它', '头', '经', '长', '儿', '回', '位', '分', '爱', '老', '因', '很', '给', '名', '法', '间', '斯', '知',
    '世', '什', '两', '次', '使', '身', '者', '被', '高', '已', '亲', '其', '进', '此', '话', '常', '与', '活', '正', '感',
    '见', '明', '问', '力', '理', '尔', '点', '文', '几', '定', '本', '公', '特', '做', '外', '孩', '相', '西', '果', '走',
    '将', '月', '十', '实', '向', '声', '车', '全', '信', '重', '三', '机', '工', '物', '气', '每', '并', '别', '真', '打',
    '太', '新', '比', '才', '便', '夫', '再', '书', '部', '水', '像', '眼', '等', '体', '却', '加', '电', '主', '界', '门',
    '利', '海', '受', '听', '表', '德', '少', '克', '代', '员', '许', '稜', '先', '口', '由', '死', '安', '写', '性', '马',
    '光', '白', '或', '住', '难', '望', '教', '命', '花', '结', '乐', '色', '更', '拉', '东', '神', '记', '处', '让', '母',
    '父', '应', '直', '字', '场', '平', '报', '友', '关', '放', '至', '张', '认', '接', '告', '入', '笑', '内', '英', '军',
    '候', '民', '岁', '往', '何', '度', '山', '觉', '路', '带', '万', '男', '边', '风', '解', '叫', '任', '金', '快', '原',
    '吃', '妈', '变', '通', '师', '立', '象', '数', '四', '失', '满', '战', '远', '格', '士', '音', '轻', '目', '条', '呢',
    '病', '始', '达', '深', '完', '今', '提', '求', '清', '王', '化', '空', '业', '思', '切', '怎', '非', '找', '片', '罗',
    '钱', '紶', '吗', '语', '元', '喜', '曾', '离', '飞', '科', '言', '干', '流', '欢', '约', '各', '即', '指', '合', '反',
    '题', '必', '该', '论', '交', '终', '林', '请', '医', '晚', '制', '球', '决', '窢', '传', '画', '保', '读', '运', '及',
    '则', '房', '早', '院', '量', '苦', '火', '布', '品', '近', '坐', '产', '答', '星', '精', '视', '五', '连', '司', '巴',
    '奇', '管', '类', '未', '朋', '且', '婚', '台', '夜', '青', '北', '队', '久', '乎', '越', '观', '落', '尽', '形', '影',
    '红', '爸', '百', '令', '周', '吧', '识', '步', '希', '亚', '术', '留', '市', '半', '热', '送', '兴', '造', '谈', '容',
    '极', '随', '演', '收', '首', '根', '讲', '整', '式', '取', '照', '办', '强', '石', '古', '华', '諣', '拿', '计', '您',
    '装', '似', '足', '双', '妻', '尼', '转', '诉', '米', '称', '丽', '客', '南', '领', '节', '衣', '站', '黑', '刻', '统',
    '断', '福', '城', '故', '历', '惊', '脸', '选', '包', '紧', '争', '另', '建', '维', '绝', '树', '系', '伤', '示', '愿',
    '持', '千', '史', '谁', '准', '联', '妇', '纪', '基', '买', '志', '静', '阿', '诗', '独', '复', '痛', '消', '社', '算',
    '义', '竟', '确', '酒', '需', '单', '治', '卡', '幸', '兰', '念', '举', '仅', '钟', '怕', '共', '毛', '句', '息', '功',
    '官', '待', '究', '跟', '穿', '室', '易', '游', '程', '号', '居', '考', '突', '皮', '哪', '费', '倒', '价', '图', '具',
    '刚', '脑', '永', '歌', '响', '商', '礼', '细', '专', '黄', '块', '脚', '味', '灵', '改', '据', '般', '破', '引', '食',
    '仍', '存', '众', '注', '笔', '甚', '某', '沉', '血', '备', '习', '校', '默', '务', '土', '微', '娘', '须', '试', '怀',
    '料', '调', '广', '蜖', '苏', '显', '赛', '查', '密', '议', '底', '列', '富', '梦', '错', '座', '参', '八', '除', '跑',
    '亮', '假', '印', '设', '线', '温', '虽', '掉', '京', '初', '养', '香', '停', '际', '致', '阳', '纸', '李', '纳', '验',
    '助', '激', '够', '严', '证', '帝', '饭', '忘', '趣', '支', '春', '集', '丈', '木', '研', '班', '普', '导', '顿', '睡',
    '展', '跳', '获', '艺', '六', '波', '察', '群', '皇', '段', '急', '庭', '创', '区', '奥', '器', '谢', '弟', '店', '否',
    '害', '草', '排', '背', '止', '组', '州', '朝', '封', '睛', '板', '角', '况', '曲', '馆', '育', '忙', '质', '河', '续',
    '哥', '呼', '若', '推', '境', '遇', '雨', '标', '姐', '充', '围', '案', '伦', '护', '冷', '警', '贝', '著', '雪', '索',
    '剧', '啊', '船', '险', '烟', '依', '斗', '值', '帮', '汉', '慢', '佛', '肯', '闻', '唱', '沙', '局', '伯', '族', '低',
    '玩', '资', '屋', '击', '速', '顾', '泪', '洲', '团', '圣', '旁', '堂', '兵', '七', '露', '园', '牛', '哭', '旅', '街',
    '劳', '型', '烈', '姑', '陈', '莫', '鱼', '异', '抱', '宝', '权', '鲁', '简', '态', '级', '票', '怪', '寻', '杀', '律',
    '胜', '份', '汽', '右', '洋', '范', '床', '舞', '秘', '午', '登', '楼', '贵', '吸', '责', '例', '追', '较', '职', '属',
    '渐', '左', '录', '丝', '牙', '党', '继', '托', '赶', '章', '智', '冲', '叶', '胡', '吉', '卖', '坚', '喝', '肉', '遗',
    '救', '修', '松', '临', '藏', '担', '戏', '善', '卫', '药', '悲', '敢', '靠', '伊', '村', '戴', '词', '森', '耳', '差',
    '短', '祖', '云', '规', '窗', '散', '迷', '油', '旧', '适', '乡', '架', '恩', '投', '弹', '铁', '博', '雷', '府', '压',
    '超', '负', '勒', '杂', '醒', '洗', '采', '毫', '嘴', '毕', '九', '冰', '既', '状', '乱', '景', '席', '珍', '童', '顶',
    '派', '素', '脱', '农', '疑', '练', '野', '按', '犯', '拍', '征', '坏', '骨', '余', '承', '置', '臓', '彩', '灯', '巨',
    '琴', '免', '环', '姆', '暗', '换', '技', '翻', '束', '增', '忍', '餐', '洛', '塞', '缺', '忆', '判', '欧', '层', '付',
    '阵', '玛', '批', '岛', '项', '狗', '休', '懂', '武', '革', '良', '恶', '恋', '委', '拥', '娜', '妙', '探', '呀', '营',
    '退', '摇', '弄', '桌', '熟', '诺', '宣', '银', '势', '奖', '宫', '忽', '套', '康', '供', '优', '课', '鸟', '喊', '降',
    '夏', '困', '刘', '罪', '亡', '鞋', '健', '模', '败', '伴', '守', '挥', '鲜', '财', '孤', '枪', '禁', '恐', '伙', '杰',
    '迹', '妹', '藸', '遍', '盖', '副', '坦', '牌', '江', '顺', '秋', '萨', '菜', '划', '授', '归', '浪', '听', '凡', '预',
    '奶', '雄', '升', '碃', '编', '典', '袋', '莱', '含', '盛', '济', '蒙', '棋', '端', '腿', '招', '释', '介', '烧', '误',
    '乾', '坤', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
    ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ']


n_pre='着泪微笑心↘承诺了色旳回憶爱控尽歌悲欢媚＠光あ瘦了~减肥呮諟吓吓肉爲什麽要愛你ξ餐伴枕有↘几人檬味的鱼有范儿然而然，我没跑三种爱情音King钻摘自:再执迷不悟。啦呮諟個夢哥大@格式化寞煙錇謌度孤独患者在天涯你在海角仅存依靠茸兔包儿人本该霸气浭喓姒氺溫柔υё鱫越吵架﹏我的没有，阴我的不少忆刺穿心脏╮城小巷萌街少年间是记忆的橡皮擦丶有特点伴是最长情的告白高不是傲■谢经历。风魔影透明nocolor°强的爱恋还长别猖狂生梦断话太过龙吟底青苔立于世o_虚冇所谓的结局多鱼好多鱼好剩余°以类聚,‘夜成仙了丶然后爱没恨-规则°纪之城如南筏〞夲亼光锟色眼眸坚强是软弱个天使替我爱你。光斑斓里遍寻色伊人必谁懂我后让自己属于我自己生不离不弃HEI炮@!河桥等你舞驚鴻事新人新心*海断长空叛自己的心禁傷害涐倾城不明媚°桃皇牌五七年落風嘯音未来仃海追梦命女要见不要贱灵的代言人|▌[祭]||▍意如海浪我是我的情人』°北的机场。醉梦未碎朵气质花°乐丶在明天D调的华丽〃眸暖光人就要傲氣气少年穷要你幸福就好于感情弄丢了自己倚剑听风-与我疯過河的卒叛逆の蒙娜丽莎せ夜╮生活搜狗不行来百度@想个名字真他妈的难冷霜美人冰寒丶月未完的旋律夜店唱戏数学不好的姑娘万岁！挑灯回望长巷歌此人不在服务区不羁放纵喜欢矜持的妞薄幸将戏十年不短i豹纹癖#浅忆Rin初生的太陽@凡物』农村大代表*爱吃兔子的胡萝卜豹文MM稍息立正站好孤僻成性怪癖爱人i被抢的乐在其中丶青春期躁动症心凉患者i青春就该不靠谱。我是牵绊i王者★孤傲一比一。再苦再累不說放棄︶错过的终究错过ゞ哖少輕狂&噯上誰-假惺惺。恶天候抬眉见雪-家庭腐女:(拭抹陽光，抱緊伱請允許珴尐尐旳驕傲如曼珠沙华，溺留花香褪了色的回憶我选择笑-仰視妑黎灿烂落日怎样ミ心淡忇◆素妆╯而y空大女王惯性上演将错就错＂我酷你随意凌乱美养条狗取名前男友太陽不懂月亮的涳虚°〆_小悲伤青春祭温柔岁月一把刀情人无话心在跳是因为你卖萌嘟嘴剪刀手亡魂复苏Jesus-予我长存只做独一无二的自己＊＊自作多情i女皇之刃小二货流行乄天真叛逆不是本能Minor昔年少年不哭瓊芳采薇俗人︷殷染因为所以-夏不煽情秒你不解释ゝ女王钻石心ゝ凌雪ぎ超洅回首ㄨ恍然如夢英雄战魂越精布条烟散红尘℃封狼居胥暧昧是火地狱狂欢時光忘記回來透在骨子裏的小霸道°我不爱哭i碎゛淚っ-凉情凉心凉时光°难免认真此qト甾上线不再畏惧Ta单恋也是正常第种死法※伪善。真的是不愛了Rose之吻沒力气再承受生性凉薄愿时光盗不走你,陌生寂寥柚子姑娘未央蓁蓁心病无药医。自欺自爱－[貴妃]南岸少年人潮拥挤i堇色素顔∫凉城空沵若喓走怭不挽留冰是睡着的水夜场玩暧昧江山沬老葒颜舊不能原谅°成年优雅的刺蝟你是我的菜，谁也别动筷巛邪恶丨灬皇朝︶可笑的敷衍。再辛楛也不説绝版男神i喵喵灬萝莉应对现实。四年桔梗水洗晴空持刀走四方烟花楼阁内，许几世繁华苍了夏靡卡卡西★戀☆浴血魔王自闭的兔子何必太天真≌骑着蜗牛找妞万有勾引力#姐要革命╭ァ随风而去。爱上一匹野马@@黑名单上的人逞强美渲染人生Macy梅茜挣扎小姑娘。看沵溈他楛闷丶殉梦,魔星君不败的恋人魅影￡孤寂框裱里的过去￡血帝↘弑天彡打折的暧昧誐╮喓庝她治愈系乡霸騎單車的小貓梦里都坚守的信仰╮一生一世烟火迷离梦影逍遥夏恋海笾°致借〃并非雾里看花造物弄人@生人勿近ゝ请叫我阿宅。不做毕剩客专敲寡妇门馬蕗牙子偶遇我淡定的眼光天然萌女軻噯范”灿烂星空@线条化丶「魚丸粗麵」勾勾手→_→跟我走时光末路为你停留i︶莫过于爱你。我不完美°但我唯掐死你的温柔心上邦迪青春摄魂药一只黑蔥容纳┢┦所有的委屈草丛之中遇女神ツ遺夨ぁミ荣誉黑手伊人浅笑醉长安要走↙我不挽留帶着沵的我，给我滚释然終點回到原點安静の陪着你怪我过分着迷比你酷也比你孤独黑色岁月不敢听情歌@与寂寞抗衡风沙迷了眼孤独好喜欢我i恶魔″专属滥情终自灭投我怀里被時間上了瑣的日記-掵中克暒諟薮敩*情毒蚀骨繁华世界糟烂的一切\"太阳给予我温暖i随意低调@ご王霸灬之气ぃ四方赏晴雨冻结心。阴阴沉沉的天迷醉%能否怺逺不分蓠不抵时光午夜噬魔冷月丶葬诗魂岁月无声i鱼の眼泪海知道云飘绫暮北。旧殇难医长笑当歌説好迡，圉湢迡倒轉流年丶只為壹眼紅顏把完美悄悄磨成回忆ゞ骚年分不清洞与菊-不及你美時光會老人會走怀抱用力风╰扬起了思念三尺瑶琴莪づ繼續一個人孤單闺蜜和莮人一起消失了松下闻桶子我又不在沵裑旁哥不諟高冨帅丶伊人從蓉梅川酷紫挥洒永不褪色苏念璃乄寂寞很高调猩红女神多谢你的不在乎不用仰望别人自己亦是风景血色杀戮者热情有限寂寞天使妱媪梓瑜裴紫寒雪丑的想整容龙腾霸主身不由己，黑夜玫瑰ㄝん值得高傲一如↘既往若要我死，你必先亡。烈焰★狂龙怕思緒走了光侧耳倾听▄︻┻┳═一魔鬼旧友与酒滚開我哊神经病i生不对べ死不起停止想念◆释青春。╰出卖百里卖麦秸ミ順⑦zī嘫我有个霸气的名字叫女汉子坏的彻底正在输入萌妹女神@谁年轻没爱过几个人渣红尘里的看戏人萌主御赐=天下第一美人拈花笑心淡然如水っ︶￣`认清η我ヽゝ高傲丶与玍俱來青春喂了不懂珍惜的狗容颜最美的婚纱参加你的葬礼__棺木°蓝梦月影[十年很久你们别走]忘得洒脱天下唯你不可弃╰☆╮菇凉我就是拽i逍遥浪子爱你爱到无药可救亡命男人无声无息。安之若素╮浮沉╮┊无需解释换上布鞋也能走出猫步怀是延伸了的海°n有种眼虽小軻心眼少i我却总睡过头且有何用生无可恋死无人葬灵羽溪良人未归つ叁噵杠骚哖行尸走肉赶去洣囯卖辣條爱你是我的必修课临时演员少年包青蛙向海旳太阳め太拿自己当回事深知我者才久居我心爱在幻觉中╰平淡メ如水販賣丶寂寞“防线狐狸已成精夕阳不落つ歹匕亡ㄋ日記搁浅的海豚欲念阻断信念心软是捅自己的刀。Sandm°繁花恋步子迈大了难免扯到蛋深海一尾鱼阴暗杀手小伙伴沵挺噻臉??°酒醉人心碎叫兔子的猫任性不认命*爱上劫难浅时光BonnenuIt▼伱给的爱太牵强迷恋你一场笑破红尘涐﹏永远开心◇妖姬三国清仓处理⒐ｏ年華[惯性]明年今日女漢子都諟自己摸胸莪卜怕輸わ第一步。灭了你°我是个吃货。不美不萌照样拽分手礼。獨人欣賞゛偷渡↗我心′流泪的向日葵摩羯座vs双子座人不犯二枉少哖i法克U(▼)森屿暖树比心思念是噬心的痛猜心游戏狼与美女的爱恋年度★演员——阳光烧死人。依旧高傲ゝ百世轮回。只为今生我能够陪你去看星星洒脱的男人。怡然自得。浪迹消磨⒐⒋﹡戒愛ㄋ荒野°抢孟婆汤嫉妒是最诚实的告白真亦假淺夏羽萱軒轅曉蕾心中住了匹自由的野马～巟繆哋喏訁收起你的憐憫刪除式ヽ記憶梦语★惜缘彡如不愛請離開情话只愿说与你听有理糊涂玩心收起独宠你一人高傲的自我頖逆メ⑨O詬孤寂稀疏的R群挚㈡别来无恙你还狗样倾尽时光暖流年灵魂伴侣⊿女银该有的范夜闯寡妇村冷月寒笙假期雷剧嗨翻天无可挑剔那么爱劈腿怎样不去跳芭蕾凌晨两点半你是旧梦暗面↘独行追求简单的小生活△与你对弈埖独蝶双飛阿Q式精神现实太狗@有多倔强就有多坚强桂花甜不如薄情是梦不是命癡心妄想柔情杀手@烟雨洛神那些难以言语的伤痛゜笙歌初寒夜未央假良人临时嘉宾再不疯狂就老了°阵亡爱人虚假爱人叫嚣ゝ〤绝无仅有暧昧有毒淡丶岀亼間星恋影随愛の灵魂作祟反派主角黑框丶眼镜__不可使用百里屠苏_劳资偏不长发及腰说好〃不忧伤ㄟ不苟言笑你不會再遇見第②個我女人本該霸氣刺猬先生没品-对伱微笑莼屬澧貌-寂寞"独陵繁华世界的我们过于单纯樱桃小丸子°披着狼皮的羊摸扎算命余生一起走，千万别放手余温短暂狂热清夫子自定义〆旋律神经领袖i失意ethanol对心事说谎悲伤专卖店僞何_~↘殤訫世上只有一个我*深拥再见温一盏杏花酒坐觀龍蛇从未离去明智小女人錢ォ是王道$你听心脏在说谎老娘不在发情期太过软弱黑翅圣灵岁月无痕。板蓝根泡面i盗梦者。叫我笾夫人哊糖吃√炙熱的夏天|▎妖娆只是小三本性ヤ半夏微凉暖冬依旧笑靥如花淡淡伤゛微微凉柔情似水么折子戏无与伦比坚持幽暗魔尊こ豆蔻年华°不⒉之言不敢妄言玩心眼子的年代觜角呐抹倔強的嶶笑っ午後明琪无缘相遇箹椗→詠遠℃微笑掩饰内心的伤秒杀你的自大缺席情人钟情于你时光忘记回来玩心眼魔鬼de温柔-不在联系°為所慾為能寂寞是一种境界﹟号Style女郎！防腐剂不要迷恋哥，嫂子会揍你抢了我的辣条还想跑没安全的孩纸拿命去愛沵ヾ多情先生依然范特西╮致我们终将失去的青春强颜欢笑曾是拥有i遗失的光波∝不蓅汨的机畼说喜欢╮距离感。▏人要活的有个性°不受控孤独患者。触我底线ˇ不做替代品\"°C瞎几把扯犊子姐不稀罕你心跳多久愛多久绝缘体哭著說再見╮★落魄*潇洒何必，等待芸萱惜偌丿坐台买爱姿态°美客户端。笑笑又何妨╮_珍藏版_拿命去拼未来握不住的沙就扬了吧陪你搞怪i凄凉↘的夜彡触不可及原谅时间从不委屈自己唇奴毁了心葬了爱へ青春综合症゛感染了你我旳回忆小资态游啊游的鱼各取所求谁能久伴不分离二才叫范故事べ未完待续男人歌。若玖居堔夏i若我溈凰-封沵溈迋℡冲淡了一切梦想de城堡面楚歌。兔子急红眼挥散不了的阴霾你走了心碎了i留給自己哭泣诡魅没有野心只想要你善变梦想家-丿永灬恒◇◆丶祭ゞ|▍Me-未成年失心°善生Sum重生ゝ我赐你万劫不复死而无墓，姐狠う拽过时的女人雨落倾城〆夜微凉〞囍你如初i我有逆鳞i错乱。*青春天生是美女红颜亦蜜恋ゆ￠爱你不是拥有你矜持↘的血月光倾泻，未必凄凉ヤ俄达不到沵的要求-冷心的暧昧﹌(り滥情。徘徊且徘徊我卻總睡過頭出息是啥子玩意奈良的鹿九夏忧傷醉夕陽”１种stye︶优雅男神浅湾。卑微的苟活毁爱心咒失效怪我叺戏太堔寂寞无需落魄ζ不爱。就_滚黑色曼陀罗淡看悲欢离合衬衣少年。眼泪掉落的那一刻&姝棠涵兒我的男神＠不做公主的女王剩女范。街头张望冷眼LIMIT两处难寻一笑傾城限量版ㄨ侽孒唯有一腔孤勇▌那颗骄傲而不知疲惫的心無邪仍在ゝ不見天真人@狗痴心季节做你的英雄封面恋人冷视↘天下→灬花凋丶爲誰祭俊颜魅惑众生°但是是些唯美的以前承诺姒雾如颩相見不如懷念糖僧ヤ“铅笔画不出的界限。撕心裂肺の痛痛苦不堪夕阳下的彩虹丶峩眔溫柔︻╮星羽流辉人生多忐忑丶印信，悲欢离合的信笺。撕下方倶還剩什么金翅大鹏歆雨&倾尘久爱不腻无间道噬魔仙灵﹏ヽ比彩钻还耀眼的男人つ桃酥话少女紫芊涵梅脱壳离久远骨子里的高雅夏的娜℃纽箹城门口旳小木匠▲情绪控,灼热岁月ゝ风雨桥上ζ那场婚礼我只是伴娘玩世不恭扑克萌脸燈光下的淒涼徘徊在黑夜哭泣。亦然不登下kiss今夜相思几许→_→向钱冲无双谱-仅此罢了つ寂寞天使有种狼会披羊皮血魅代葬人潮拥挤，我挤死你丶飞鸽传情◣惊艳℡没存在感的忏悔√╰麦兜兜╯谁为我描绘一生的梦以噯掵名de童话﹌口头爱人。￠煞笔女人烟花再美，只在一瞬间事不关己，高高挂起。無姳〆籹孓嵗月并悱如戨∑出界唯愛成性感mmˇ世事如书＝怪咖女人热血愤青堇年_伊人倾城毙命爵士旧人离梦手嗱香煙征战囧途怪我难拥人心伤已成曲时间爱人‘钓马男神丿低凋进行曲丑的不嫉妒〆得味女人。童年，挨打的时光虎牙少年快乐至上％賤夶┒伱瀀祘葚駡匿名朋友っ眼里的寂寞。英雄梦想i回忆就足够°Щ我的快乐幼儿园杠把子你,不可原谅单膝跪地唱征服°忽然之间一人情歌'

class NameTool(object):
    def __init__(self):
        pass

    def gen_name(self):
        return str(random.choice(xing) + random.choice(ming) + random.choice(ming)).replace(' ', '')

    def gen_nick_name(self):
        return ''.join(random.choice(n_pre) for i in range(random.randint(1, 12)))

def getInstance():
    return NameTool()